2022-2023/Programming Level-up/2.object-oriented-programming.org
#+title: Programming Level-up
#+SUBTITLE: Lecture 2 - More advanced Python & Classes
#+date: 20th September 2022
#+author: Jay Morgan
#+include: ./header.org

#+name: commentify
#+begin_src emacs-lisp :var result="" :exports none
(with-output-to-string
  (princ "Results: \n")
  (dolist (result-item (split-string result "\n"))
    (princ (concat "# => " (format "%s\n" result-item)))))
#+end_src

* Proxy

** Univ-tln proxy

*** Setting up a proxy in Linux -- environment variables

Environment variables are variables that are set in the Linux environment and are
used to configure some high-level details in Linux.

The command to create/set an environment is:

#+begin_src
export VARIABLE_NAME=''
#+end_src

Exporting a variable in this way will mean =VARIABLE_NAME= will be accessible while
you're logged in. Every time you log in you will have to set this variable again.

*** Setting up a proxy in Linux -- univ-tln specific

In the université de Toulon, you're required to use the university's proxy server to
access the internet. Therefore, in Linux at least, you will have to tell the system
where the proxy server is with an environment variable.

#+begin_src bash
export HTTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export HTTPS_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export FTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
#+end_src

*NOTE*: Watch out for special characters in your password! They will have to be URL encoded.

*** Setting up a proxy in the .bashrc

If you don't wish to set the variable every time log in, you should enter the same
commands into a =.bashrc= in your home directory.

#+begin_src bash
export HTTP_PROXY='...'
export HTTPS_PROXY='...'
export FTP_PROXY='...'
#+end_src

#+RESULTS:

When you log in, the =.bashrc= file will be run and these variables will be set for you.

* Dealing with Errors

** Exceptions

*** Dealing with Errors

When programming, its good to be defensive and handle errors gracefully. For example,
if you're creating a program, that as part of its process, reads from a file, its
possible that this file may not exist at the point the program tries to read it. If
it doesn't exist, the program will crash giving an error such as: =FileNotfoundError=.

Perhaps this file is non-essential to the operation of the program, and we can
continue without the file. In these cases, we will want to appropriately catch the
error to prevent it from stopping Python.

