2022-2023/Programming Level-up/2.object-oriented-programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-11 Sun 08:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming Level-up</title>
<meta name="author" content="Jay Morgan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Programming Level-up
<br />
<span class="subtitle">Lecture 2 - More advanced Python &amp; Classes</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4956d7d">1. Proxy</a>
<ul>
<li><a href="#org91c8616">1.1. Univ-tln proxy</a>
<ul>
<li><a href="#org4571d5b">1.1.1. Setting up a proxy in Linux &#x2013; environment variables</a></li>
<li><a href="#org8484eac">1.1.2. Setting up a proxy in Linux &#x2013; univ-tln specific</a></li>
<li><a href="#orgfb186cb">1.1.3. Setting up a proxy in the .bashrc</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7d22fd1">2. Dealing with Errors</a>
<ul>
<li><a href="#org5268776">2.1. Exceptions</a>
<ul>
<li><a href="#orgd53b243">2.1.1. Dealing with Errors</a></li>
<li><a href="#org635bcad">2.1.2. Try-catch</a></li>
<li><a href="#org9e46fe1">2.1.3. Try-catch &#x2013; capturing messages</a></li>
<li><a href="#org258116c">2.1.4. Types of exceptions</a></li>
<li><a href="#org798deb4">2.1.5. Assertions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1190d3b">3. OOP</a>
<ul>
<li><a href="#orgbacad67">3.1. Classes</a>
<ul>
<li><a href="#orgf9bed95">3.1.1. Introduction to classes</a></li>
<li><a href="#orgf36b01e">3.1.2. Basic syntax</a></li>
<li><a href="#org4605e75">3.1.3. Init method</a></li>
<li><a href="#org0815705">3.1.4. Instantiating</a></li>
<li><a href="#org4b72c25">3.1.5. Class variables</a></li>
<li><a href="#orgdacf551">3.1.6. Class Methods</a></li>
<li><a href="#org51f05a6">3.1.7. dunder-methods</a></li>
<li><a href="#org21e2db1">3.1.8. dunder-methods</a></li>
<li><a href="#org60bca53">3.1.9. dunder-methods</a></li>
<li><a href="#orge8fd06e">3.1.10. <code>__len__</code></a></li>
<li><a href="#orgf9499e3">3.1.11. <code>__getitem__</code></a></li>
<li><a href="#org6780ce6">3.1.12. <code>__call__</code></a></li>
<li><a href="#org89c7070">3.1.13. <code>__iter__</code> and <code>__next__</code></a></li>
<li><a href="#org2332351">3.1.14. <code>__iter__</code> and <code>__next__</code></a></li>
<li><a href="#orgc7dc350">3.1.15. <code>__iter__</code> and <code>__next__</code></a></li>
<li><a href="#orgf8dfad0">3.1.16. Inheritance</a></li>
<li><a href="#orgac4984f">3.1.17. Inheritance</a></li>
<li><a href="#org87ad9f8">3.1.18. Inheritance</a></li>
<li><a href="#org33ae360">3.1.19. Inheritance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbee7ae7">4. Exercise</a>
<ul>
<li><a href="#org528c13d">4.1. Exercise</a>
<ul>
<li><a href="#org44070a6">4.1.1. An object based library system</a></li>
<li><a href="#org8d56891">4.1.2. Adding data</a></li>
<li><a href="#org6d3b05d">4.1.3. Locating a book</a></li>
<li><a href="#org6105411">4.1.4. Updating our database</a></li>
<li><a href="#org99cba8e">4.1.5. Printed representation</a></li>
<li><a href="#orgd219c6a">4.1.6. Extending our OOP usage</a></li>
<li><a href="#org3be4fbc">4.1.7. Printed representation &#x2013; challenge.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4956d7d" class="outline-2">
<h2 id="org4956d7d"><span class="section-number-2">1.</span> Proxy</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org91c8616" class="outline-3">
<h3 id="org91c8616"><span class="section-number-3">1.1.</span> Univ-tln proxy</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org4571d5b" class="outline-4">
<h4 id="org4571d5b"><span class="section-number-4">1.1.1.</span> Setting up a proxy in Linux &#x2013; environment variables</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Environment variables are variables that are set in the Linux environment and are
used to configure some high-level details in Linux.
</p>

<p>
The command to create/set an environment is:
</p>

<pre class="example">
export VARIABLE_NAME=''
</pre>

<p>
Exporting a variable in this way will mean <code>VARIABLE_NAME</code> will be accessible while
you're logged in. Every time you log in you will have to set this variable again.
</p>
</div>
</div>

<div id="outline-container-org8484eac" class="outline-4">
<h4 id="org8484eac"><span class="section-number-4">1.1.2.</span> Setting up a proxy in Linux &#x2013; univ-tln specific</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
In the université de Toulon, you're required to use the university's proxy server to
access the internet. Therefore, in Linux at least, you will have to tell the system
where the proxy server is with an environment variable.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #56B6C2;">export</span> <span style="color: #E06C75;">HTTP_PROXY</span>=<span style="color: #98C379;">'&lt;username&gt;:&lt;password&gt;@proxy.univ-tln.fr:3128'</span>
<span style="color: #56B6C2;">export</span> <span style="color: #E06C75;">HTTPS_PROXY</span>=<span style="color: #98C379;">'&lt;username&gt;:&lt;password&gt;@proxy.univ-tln.fr:3128'</span>
<span style="color: #56B6C2;">export</span> <span style="color: #E06C75;">FTP_PROXY</span>=<span style="color: #98C379;">'&lt;username&gt;:&lt;password&gt;@proxy.univ-tln.fr:3128'</span>
</pre>
</div>

<p>
<b>NOTE</b>: Watch out for special characters in your password! They will have to be URL encoded.
</p>
</div>
</div>

<div id="outline-container-orgfb186cb" class="outline-4">
<h4 id="orgfb186cb"><span class="section-number-4">1.1.3.</span> Setting up a proxy in the .bashrc</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
If you don't wish to set the variable every time log in, you should enter the same
commands into a <code>.bashrc</code> in your home directory.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #56B6C2;">export</span> <span style="color: #E06C75;">HTTP_PROXY</span>=<span style="color: #98C379;">'...'</span>
<span style="color: #56B6C2;">export</span> <span style="color: #E06C75;">HTTPS_PROXY</span>=<span style="color: #98C379;">'...'</span>
<span style="color: #56B6C2;">export</span> <span style="color: #E06C75;">FTP_PROXY</span>=<span style="color: #98C379;">'...'</span>
</pre>
</div>

<p>
When you log in, the <code>.bashrc</code> file will be run and these variables will be set for you.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7d22fd1" class="outline-2">
<h2 id="org7d22fd1"><span class="section-number-2">2.</span> Dealing with Errors</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5268776" class="outline-3">
<h3 id="org5268776"><span class="section-number-3">2.1.</span> Exceptions</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgd53b243" class="outline-4">
<h4 id="orgd53b243"><span class="section-number-4">2.1.1.</span> Dealing with Errors</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
When programming, its good to be defensive and handle errors gracefully. For example,
if you're creating a program, that as part of its process, reads from a file, its
possible that this file may not exist at the point the program tries to read it. If
it doesn't exist, the program will crash giving an error such as: <code>FileNotfoundError</code>.
</p>

<p>
Perhaps this file is non-essential to the operation of the program, and we can
continue without the file. In these cases, we will want to appropriately catch the
error to prevent it from stopping Python.
</p>
</div>
</div>
