2022-2023/Programming Level-up/2.object-oriented-programming.tex
% Created 2022-08-19 ven. 10:45
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{xcolor}
\definecolor{LightGray}{gray}{0.95}
\usefonttheme{professionalfonts}
\setlength{\parskip}{5pt}
\newcommand{\footnoteframe}[1]{\footnote[frame]{#1}}
\addtobeamertemplate{footnote}{}{\vspace{2ex}}
\usepackage{tabularx}
\usepackage{booktabs}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\scriptsize}
\usetheme{Berkeley}
\author{Jay Morgan}
\date{2021-10-01}
\title{Programming Level-up}
\subtitle{Lecture 2 - More advanced Python \& Classes}
\hypersetup{
 pdfauthor={Jay Morgan},
 pdftitle={Programming Level-up},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\section{Proxy}
\label{sec:orgbe8cf79}

\subsection{Univ-tln proxy}
\label{sec:orgd1f7480}

\begin{frame}[label={sec:org2001cc4},fragile]{Setting up a proxy in Linux -- environment variables}
 Environment variables are variables that are set in the Linux environment and are
used to configure some high-level details in Linux.

The command to create/set an environment is:

\begin{verbatim}
export VARIABLE_NAME=''
\end{verbatim}

Exporting a variable in this way will mean \texttt{VARIABLE\_NAME} will be accessible while
you're logged in. Every time you log in you will have to set this variable again.
\end{frame}

\begin{frame}[label={sec:org21eb05a},fragile]{Setting up a proxy in Linux -- univ-tln specific}
 In the université de Toulon, you're required to use the university's proxy server to
access the internet. Therefore, in Linux at least, you will have to tell the system
where the proxy server is with an environment variable.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{bash}
export HTTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export HTTPS_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export FTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
\end{minted}

\alert{NOTE}: Watch out for special characters in your password! They will have to be URL encoded.
\end{frame}

\begin{frame}[label={sec:orge0b1395},fragile]{Setting up a proxy in the .bashrc}
 If you don't wish to set the variable every time log in, you should enter the same
commands into a \texttt{.bashrc} in your home directory.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{bash}
export HTTP_PROXY='...'
export HTTPS_PROXY='...'
export FTP_PROXY='...'
\end{minted}

When you log in, the \texttt{.bashrc} file will be run and these variables will be set for you.
\end{frame}

\section{Dealing with Errors}
\label{sec:org2ef4256}

\subsection{Exceptions}
\label{sec:org1aa8008}

\begin{frame}[label={sec:org7902498},fragile]{Dealing with Errors}
 When programming, its good to be defensive and handle errors gracefully. For example,
if you're creating a program, that as part of its process, reads from a file, its
possible that this file may not exist at the point the program tries to read it. If
it doesn't exist, the program will crash giving an error such as: \texttt{FileNotfoundError}.

Perhaps this file is non-essential to the operation of the program, and we can
continue without the file. In these cases, we will want to appropriately catch the
error to prevent it from stopping Python.
\end{frame}
