2022-2023/Programming Level-up/2.object-oriented-programming.org
*** Try-catch

Try-catches are keywords that introduce a scope where the statements are executed,
and if an error (of a certain type IndexError in this example) occurs, different
statements could be executed.

In this example, we are trying to access an element in a list using an index larger
than the length of the list. This will produce an =IndexError=. Instead of exiting
Python with an error, however, we can catch the error, and print a string.

#+begin_src python
x = [1, 2, 3]

try:
    print(x[3])
except IndexError:
    print("Couldn't access element")
#+end_src

#+RESULTS:
: Results: 
: # => Couldn't access element

*** Try-catch -- capturing messages

If we wanted to include the original error message in the print statement, we can use
the form:

#+begin_src
except <error> as <variable>
#+end_src

This provides us with an variable containing the original error that we can use later
on in the try-catch form.

#+begin_src python
x = [1, 2, 3]

try:
    print(x[3])
except IndexError as e:
    print(f"Couldn't access elements at index beacuse: {e}")
#+end_src

#+RESULTS:
: Results: 
: # => Couldn't access elements at index beacuse: list index out of range

*** Types of exceptions

There are numerous types of errors that could occur in a Python. Here are just some
of the most common.

- IndexError -- Raised when a sequence subscript is out of range.
- ValueError -- Raised when an operation or function receives an argument that has the right type but an inappropriate value
- AssertionError -- Raised when an assert statement fails.
- FileNotFoundError -- Raised when a file or directory is requested but doesn’t exist.

The full list of exceptions in Python 3 can be found at: [[https://docs.python.org/3/library/exceptions.html]]

*** Assertions

One of the previous errors (=AssertionError=) occurs when an assert statement
fails. Assert is a keyword provided to test some condition and raise an error if the
condition is false. It typically requires less code than an =if=-statement that raises
an error, so they might be useful for checking the inputs to functions, for example:

#+begin_src python
def my_divide(a, b):
    assert b != 0
    return a / b

my_divide(1, 2)
my_divide(1, 0)
#+end_src

Here we are checking that the divisor is not a 0, in which case division is not defined.

* OOP
** Classes

*** Introduction to classes

A class is some representation (can be abstract) of an object. Classes can be used to
create some kind of structure that can be manipulated and changed, just like the ways
you've seen with lists, dictionaries, etc.

Classes allow us to perform Object-oriented Programming (OOP), where we represent
concepts by classes.

But to properly understand how classes work, and why we would want to use them, we
should take a look at some examples.

*** Basic syntax

We're going to start off with the very basic syntax, and build up some more complex
classes.

To create a class, we use the =class= keyword, and give our new class a name. This
introduces a new scope in Python, the scope of the class.

Typically, the first thing we shall see in the class is the =__init__= function.

#+begin_src python
class <name_of_class>:
    def __init__(self, args*):
        <body>
#+end_src

