2022-2023/Programming Level-up/2.object-oriented-programming.html

<div id="outline-container-org635bcad" class="outline-4">
<h4 id="org635bcad"><span class="section-number-4">2.1.2.</span> Try-catch</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Try-catches are keywords that introduce a scope where the statements are executed,
and if an error (of a certain type IndexError in this example) occurs, different
statements could be executed.
</p>

<p>
In this example, we are trying to access an element in a list using an index larger
than the length of the list. This will produce an <code>IndexError</code>. Instead of exiting
Python with an error, however, we can catch the error, and print a string.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #E06C75;">x</span> = [1, 2, 3]

<span style="color: #C678DD;">try</span>:
    <span style="color: #56B6C2;">print</span>(x[3])
<span style="color: #C678DD;">except</span> <span style="color: #E5C07B;">IndexError</span>:
    <span style="color: #56B6C2;">print</span>(<span style="color: #98C379;">"Couldn't access element"</span>)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Couldn't access element
</pre>
</div>
</div>

<div id="outline-container-org9e46fe1" class="outline-4">
<h4 id="org9e46fe1"><span class="section-number-4">2.1.3.</span> Try-catch &#x2013; capturing messages</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
If we wanted to include the original error message in the print statement, we can use
the form:
</p>

<pre class="example">
except &lt;error&gt; as &lt;variable&gt;
</pre>

<p>
This provides us with an variable containing the original error that we can use later
on in the try-catch form.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #E06C75;">x</span> = [1, 2, 3]

<span style="color: #C678DD;">try</span>:
    <span style="color: #56B6C2;">print</span>(x[3])
<span style="color: #C678DD;">except</span> <span style="color: #E5C07B;">IndexError</span> <span style="color: #C678DD;">as</span> e:
    <span style="color: #56B6C2;">print</span>(f<span style="color: #98C379;">"Couldn't access elements at index beacuse: </span>{e}<span style="color: #98C379;">"</span>)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Couldn't access elements at index beacuse: list index out of range
</pre>
</div>
</div>

<div id="outline-container-org258116c" class="outline-4">
<h4 id="org258116c"><span class="section-number-4">2.1.4.</span> Types of exceptions</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
There are numerous types of errors that could occur in a Python. Here are just some
of the most common.
</p>

<ul class="org-ul">
<li>IndexError &#x2013; Raised when a sequence subscript is out of range.</li>
<li>ValueError &#x2013; Raised when an operation or function receives an argument that has the right type but an inappropriate value</li>
<li>AssertionError &#x2013; Raised when an assert statement fails.</li>
<li>FileNotFoundError &#x2013; Raised when a file or directory is requested but doesn’t exist.</li>
</ul>

<p>
The full list of exceptions in Python 3 can be found at: <a href="https://docs.python.org/3/library/exceptions.html">https://docs.python.org/3/library/exceptions.html</a>
</p>
</div>
</div>

<div id="outline-container-org798deb4" class="outline-4">
<h4 id="org798deb4"><span class="section-number-4">2.1.5.</span> Assertions</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
One of the previous errors (<code>AssertionError</code>) occurs when an assert statement
fails. Assert is a keyword provided to test some condition and raise an error if the
condition is false. It typically requires less code than an <code>if</code>-statement that raises
an error, so they might be useful for checking the inputs to functions, for example:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">my_divide</span>(a, b):
    <span style="color: #C678DD;">assert</span> b != 0
    <span style="color: #C678DD;">return</span> a / b

my_divide(1, 2)
my_divide(1, 0)
</pre>
</div>

<p>
Here we are checking that the divisor is not a 0, in which case division is not defined.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1190d3b" class="outline-2">
<h2 id="org1190d3b"><span class="section-number-2">3.</span> OOP</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbacad67" class="outline-3">
<h3 id="orgbacad67"><span class="section-number-3">3.1.</span> Classes</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgf9bed95" class="outline-4">
<h4 id="orgf9bed95"><span class="section-number-4">3.1.1.</span> Introduction to classes</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
A class is some representation (can be abstract) of an object. Classes can be used to
create some kind of structure that can be manipulated and changed, just like the ways
you've seen with lists, dictionaries, etc.
</p>

<p>
Classes allow us to perform Object-oriented Programming (OOP), where we represent
concepts by classes.
</p>

<p>
But to properly understand how classes work, and why we would want to use them, we
should take a look at some examples.
</p>
</div>
</div>

<div id="outline-container-orgf36b01e" class="outline-4">
<h4 id="orgf36b01e"><span class="section-number-4">3.1.2.</span> Basic syntax</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
We're going to start off with the very basic syntax, and build up some more complex
classes.
</p>

<p>
To create a class, we use the <code>class</code> keyword, and give our new class a name. This
introduces a new scope in Python, the scope of the class.
</p>

<p>
Typically, the first thing we shall see in the class is the <code>__init__</code> function.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> &lt;name_of_class&gt;:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, args*):
        &lt;body&gt;
</pre>
</div>
</div>
</div>
