2022-2023/Programming Level-up/2.object-oriented-programming.tex

\begin{frame}[label={sec:org40413a4},fragile]{Try-catch}
 Try-catches are keywords that introduce a scope where the statements are executed,
and if an error (of a certain type IndexError in this example) occurs, different
statements could be executed.

In this example, we are trying to access an element in a list using an index larger
than the length of the list. This will produce an \texttt{IndexError}. Instead of exiting
Python with an error, however, we can catch the error, and print a string.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
x = [1, 2, 3]

try:
    print(x[3])
except IndexError:
    print("Couldn't access element")
\end{minted}

\begin{verbatim}
Results: 
# => Couldn't access element
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgbc5b2b4},fragile]{Try-catch -- capturing messages}
 If we wanted to include the original error message in the print statement, we can use
the form:

\begin{verbatim}
except <error> as <variable>
\end{verbatim}

This provides us with an variable containing the original error that we can use later
on in the try-catch form.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
x = [1, 2, 3]

try:
    print(x[3])
except IndexError as e:
    print(f"Couldn't access elements at index beacuse: {e}")
\end{minted}

\begin{verbatim}
Results: 
# => Couldn't access elements at index beacuse: list index out of range
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org45aa20b}]{Types of exceptions}
There are numerous types of errors that could occur in a Python. Here are just some
of the most common.

\begin{itemize}
\item IndexError -- Raised when a sequence subscript is out of range.
\item ValueError -- Raised when an operation or function receives an argument that has the right type but an inappropriate value
\item AssertionError -- Raised when an assert statement fails.
\item FileNotFoundError -- Raised when a file or directory is requested but doesn’t exist.
\end{itemize}

The full list of exceptions in Python 3 can be found at: \url{https://docs.python.org/3/library/exceptions.html}
\end{frame}

\begin{frame}[label={sec:org0152903},fragile]{Assertions}
 One of the previous errors (\texttt{AssertionError}) occurs when an assert statement
fails. Assert is a keyword provided to test some condition and raise an error if the
condition is false. It typically requires less code than an \texttt{if}-statement that raises
an error, so they might be useful for checking the inputs to functions, for example:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
def my_divide(a, b):
    assert b != 0
    return a / b

my_divide(1, 2)
my_divide(1, 0)
\end{minted}

Here we are checking that the divisor is not a 0, in which case division is not defined.
\end{frame}

\section{OOP}
\label{sec:org6204ecc}
\subsection{Classes}
\label{sec:org4a7ad4d}

\begin{frame}[label={sec:orgc949d8d}]{Introduction to classes}
A class is some representation (can be abstract) of an object. Classes can be used to
create some kind of structure that can be manipulated and changed, just like the ways
you've seen with lists, dictionaries, etc.

Classes allow us to perform Object-oriented Programming (OOP), where we represent
concepts by classes.

But to properly understand how classes work, and why we would want to use them, we
should take a look at some examples.
\end{frame}

\begin{frame}[label={sec:orgfb12de4},fragile]{Basic syntax}
 We're going to start off with the very basic syntax, and build up some more complex
classes.

To create a class, we use the \texttt{class} keyword, and give our new class a name. This
introduces a new scope in Python, the scope of the class.

Typically, the first thing we shall see in the class is the \texttt{\_\_init\_\_} function.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
class <name_of_class>:
    def __init__(self, args*):
        <body>
\end{minted}
\end{frame}
