2022-2023/Programming Level-up/2.object-oriented-programming.html

<div id="outline-container-org4605e75" class="outline-4">
<h4 id="org4605e75"><span class="section-number-4">3.1.3.</span> Init method</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
The <code>__init__</code> function is a function that gets called automatically as soon as a class
is made. This init function can take many arguments, but must always start with a
<code>self</code>.
</p>

<p>
In this example, we are creating a class that represents an x, y coordinate. We've
called this class <code>Coordinate</code>, and we've defined our init function to take an x and y
values when the class is being created.
</p>

<p>
<b>Note</b> its more typical to use titlecase when specifying the class name. So when
reading code its easy to see when you're creating a class versus calling a
function. You should use this style.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Coordinate</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, x, y):
        <span style="color: #C678DD;">self</span>.x = x
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">y</span> = y
</pre>
</div>
</div>
</div>

<div id="outline-container-org0815705" class="outline-4">
<h4 id="org0815705"><span class="section-number-4">3.1.4.</span> Instantiating</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
To create an <i>instance</i> of this class, call the name of the class as you would a
function, and pass any parameters you've defined in the init function.
</p>

<p>
In this example, we are creating a new vector using <code>Vector(...)</code> and we're passing the
x and y coordinate.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Vector</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, x, y):
        <span style="color: #C678DD;">self</span>.x = x
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">y</span> = y


<span style="color: #E06C75;">point_1</span> = Vector(5, 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b72c25" class="outline-4">
<h4 id="org4b72c25"><span class="section-number-4">3.1.5.</span> Class variables</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
In the previous example, we've been creating a class variables by using
<code>self.&lt;variable_name&gt;</code>. This is telling Python <i>this class should have a variable of
this name</i>.
</p>

<p>
It allows then to reference the variable when working with the class.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Vector</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, x, y):
        <span style="color: #C678DD;">self</span>.x = x
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">y</span> = y
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">length</span> = <span style="color: #C678DD;">self</span>.x + <span style="color: #C678DD;">self</span>.y

<span style="color: #E06C75;">point_1</span> = Vector(5, 2)
<span style="color: #56B6C2;">print</span>(point_1.x)
<span style="color: #56B6C2;">print</span>(point_1.y)
<span style="color: #56B6C2;">print</span>(point_1.length)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 5
# =&gt; 2
# =&gt; 7
</pre>
</div>
</div>

<div id="outline-container-orgdacf551" class="outline-4">
<h4 id="orgdacf551"><span class="section-number-4">3.1.6.</span> Class Methods</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
A class can have many methods associated with it. To create a new method, we create a
function within the scope of the class, remember that the first parameter of the
function should be <code>self</code>.
</p>

<p>
Even in these functions, we can refer to our <code>self.x</code> and <code>self.y</code> within this new
function.
</p>

<p>
You'll notice that to call this function, we using the <code>.length()</code> method similar to
how we've worked with strings/lists/etc. This is because in Python, everything is an
object!
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Vector</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, x, y):
        <span style="color: #C678DD;">self</span>.x = x
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">y</span> = y

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">length</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #C678DD;">return</span> <span style="color: #C678DD;">self</span>.x + <span style="color: #C678DD;">self</span>.y


<span style="color: #E06C75;">my_point</span> = Vector(2, 5)
<span style="color: #56B6C2;">print</span>(my_point.length())
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 7
</pre>
</div>
</div>

<div id="outline-container-org51f05a6" class="outline-4">
<h4 id="org51f05a6"><span class="section-number-4">3.1.7.</span> dunder-methods</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
While we could, for example, create a function called <code>.print()</code>, sometimes we would
like to use the in built functions like <code>print()</code>. When creating a class, there is a
set of <i>dunder-methods</i> (double-under to reference the two '<code>__</code>' characters either side
of the function name).
</p>

<p>
One of these dunder-methods is <code>__repr__</code>, which allows us to specify how the object
looks when its printed.
</p>
</div>
</div>

<div id="outline-container-org21e2db1" class="outline-4">
<h4 id="org21e2db1"><span class="section-number-4">3.1.8.</span> dunder-methods</h4>
<div class="outline-text-4" id="text-3-1-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">OldVector</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, x, y):
        <span style="color: #C678DD;">self</span>.x = x
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">y</span> = y

<span style="color: #56B6C2;">print</span>(OldVector(2, 5))

<span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Vector</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, x, y):
        <span style="color: #C678DD;">self</span>.x = x
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">y</span> = y

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__repr__</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #C678DD;">return</span> f<span style="color: #98C379;">"Vector(</span>{<span style="color: #C678DD;">self</span>.x}<span style="color: #98C379;">, </span>{<span style="color: #C678DD;">self</span>.y}<span style="color: #98C379;">)"</span>

<span style="color: #56B6C2;">print</span>(Vector(2, 5))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; &lt;__main__.OldVector object at 0x7f658721e250&gt;
