2022-2023/Programming Level-up/2.object-oriented-programming.org
*** dunder-methods

There are many more dunder-methods you should know when creating classes. We shall go through:

- =__len__= -- specify how the length of the class should be computed.
- =__getitem__= -- how to index over the class
- =__call__= -- how to use the class like a function
- =__iter__= -- what to do when iteration starts
- =__next__= -- what to do at the next step of the iteration

*** =__len__=

The =__len__= function allows us to specify how the =len()= function acts on the
class. Take this hypothetical dataset. We create a =__len__= function that returns the
length of the unique elements in the dataset.

#+begin_src python
class Dataset:
    def __init__(self, data):
        self.data = data

    def __len__(self):
        """Return the length of unique elements"""
        return len(set(self.data))

data = Dataset([1, 2, 3, 3, 3, 5, 1])
print(len(data))
#+end_src

#+RESULTS:
: Results: 
: # => 4

*** =__getitem__=

Next =__getitem__= allows us to index over a class. This new function must include =self=
and a variable to pass the index. Here I've used =idx=. In this function I am simply
indexing on the on the classes =self.data=.

#+begin_src python
class Dataset:
    def __init__(self, data):
        self.data = data

    def __getitem__(self, idx):
        return self.data[idx]

data = Dataset([1, 2, 3, 3, 3, 5, 1])
print(data[2])
#+end_src

#+RESULTS:
: Results: 
: # => 3

*** =__call__=

In a small number of cases, it is nice to use the class just like a function. This is
what =__call__= allows us to do. In this function we specify what should happen when
class is 'called' like a function. In this simple example, we are creating a function
that prints the type of food being used as a parameter to the function.

#+begin_src python
class Jaguar:
    def __call__(self, food):
        print(f"The jaguar eats the {food}.")

food = "apple"
animal = Jaguar()

animal(food)
#+end_src

#+RESULTS:
: Results: 
: # => The jaguar eats the apple.

*** =__iter__= and =__next__=

=__iter__= and =__next__= allow us to make our class iterable, i.e. we can use it in a
=for= loop for example.

The =__iter__= function should define what happens when we start the iteration, and
=__next__= defines what happens at every step of the iteration.

Let's take a look at an example where we have an iterable set of prime numbers.

*** =__iter__= and =__next__=

#+begin_src python :session *primes*
class Primes:
    def __init__(self):
        self.primes = [2, 3, 5, 7, 11]

    def __iter__(self):
        self.idx = 0
        return self

    def __len__(self):
        return len(self.primes)

    def __next__(self):
        if self.idx < len(self):
            item = self.primes[self.idx]
            self.idx += 1
            return item
        else:
            raise StopIteration
#+END_SRC

*** =__iter__= and =__next__=

And now we can iterate over this class

#+begin_src python :session *primes*
prime_numbers = Primes()

for prime_number in prime_numbers:
    print(prime_number)
#+end_src

#+RESULTS:
: Results: 
: # => 2
: # => 3
: # => 5
: # => 7
: # => 11

