2022-2023/Programming Level-up/2.object-oriented-programming.html
# =&gt; Vector(2, 5)
</pre>
</div>
</div>

<div id="outline-container-org60bca53" class="outline-4">
<h4 id="org60bca53"><span class="section-number-4">3.1.9.</span> dunder-methods</h4>
<div class="outline-text-4" id="text-3-1-9">
<p>
There are many more dunder-methods you should know when creating classes. We shall go through:
</p>

<ul class="org-ul">
<li><code>__len__</code> &#x2013; specify how the length of the class should be computed.</li>
<li><code>__getitem__</code> &#x2013; how to index over the class</li>
<li><code>__call__</code> &#x2013; how to use the class like a function</li>
<li><code>__iter__</code> &#x2013; what to do when iteration starts</li>
<li><code>__next__</code> &#x2013; what to do at the next step of the iteration</li>
</ul>
</div>
</div>

<div id="outline-container-orge8fd06e" class="outline-4">
<h4 id="orge8fd06e"><span class="section-number-4">3.1.10.</span> <code>__len__</code></h4>
<div class="outline-text-4" id="text-3-1-10">
<p>
The <code>__len__</code> function allows us to specify how the <code>len()</code> function acts on the
class. Take this hypothetical dataset. We create a <code>__len__</code> function that returns the
length of the unique elements in the dataset.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Dataset</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, data):
        <span style="color: #C678DD;">self</span>.data = data

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__len__</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #98C379;">"""Return the length of unique elements"""</span>
        <span style="color: #C678DD;">return</span> <span style="color: #56B6C2;">len</span>(<span style="color: #56B6C2;">set</span>(<span style="color: #C678DD;">self</span>.data))

<span style="color: #E06C75;">data</span> = Dataset([1, 2, 3, 3, 3, 5, 1])
<span style="color: #56B6C2;">print</span>(<span style="color: #56B6C2;">len</span>(data))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 4
</pre>
</div>
</div>

<div id="outline-container-orgf9499e3" class="outline-4">
<h4 id="orgf9499e3"><span class="section-number-4">3.1.11.</span> <code>__getitem__</code></h4>
<div class="outline-text-4" id="text-3-1-11">
<p>
Next <code>__getitem__</code> allows us to index over a class. This new function must include <code>self</code>
and a variable to pass the index. Here I've used <code>idx</code>. In this function I am simply
indexing on the on the classes <code>self.data</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Dataset</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>, data):
        <span style="color: #C678DD;">self</span>.data = data

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__getitem__</span>(<span style="color: #C678DD;">self</span>, idx):
        <span style="color: #C678DD;">return</span> <span style="color: #C678DD;">self</span>.data[idx]

<span style="color: #E06C75;">data</span> = Dataset([1, 2, 3, 3, 3, 5, 1])
<span style="color: #56B6C2;">print</span>(data[2])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 3
</pre>
</div>
</div>

<div id="outline-container-org6780ce6" class="outline-4">
<h4 id="org6780ce6"><span class="section-number-4">3.1.12.</span> <code>__call__</code></h4>
<div class="outline-text-4" id="text-3-1-12">
<p>
In a small number of cases, it is nice to use the class just like a function. This is
what <code>__call__</code> allows us to do. In this function we specify what should happen when
class is 'called' like a function. In this simple example, we are creating a function
that prints the type of food being used as a parameter to the function.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Jaguar</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__call__</span>(<span style="color: #C678DD;">self</span>, food):
        <span style="color: #56B6C2;">print</span>(f<span style="color: #98C379;">"The jaguar eats the </span>{food}<span style="color: #98C379;">."</span>)

food = <span style="color: #98C379;">"apple"</span>
<span style="color: #E06C75;">animal</span> = Jaguar()

animal(food)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; The jaguar eats the apple.
</pre>
</div>
</div>

<div id="outline-container-org89c7070" class="outline-4">
<h4 id="org89c7070"><span class="section-number-4">3.1.13.</span> <code>__iter__</code> and <code>__next__</code></h4>
<div class="outline-text-4" id="text-3-1-13">
<p>
<code>__iter__</code> and <code>__next__</code> allow us to make our class iterable, i.e. we can use it in a
<code>for</code> loop for example.
</p>

<p>
The <code>__iter__</code> function should define what happens when we start the iteration, and
<code>__next__</code> defines what happens at every step of the iteration.
</p>

<p>
Let's take a look at an example where we have an iterable set of prime numbers.
</p>
</div>
</div>

<div id="outline-container-org2332351" class="outline-4">
<h4 id="org2332351"><span class="section-number-4">3.1.14.</span> <code>__iter__</code> and <code>__next__</code></h4>
<div class="outline-text-4" id="text-3-1-14">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Primes</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__init__</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #C678DD;">self</span>.primes = [2, 3, 5, 7, 11]

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__iter__</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">idx</span> = 0
        <span style="color: #C678DD;">return</span> <span style="color: #C678DD;">self</span>

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__len__</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #C678DD;">return</span> <span style="color: #56B6C2;">len</span>(<span style="color: #C678DD;">self</span>.primes)

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">__next__</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #C678DD;">if</span> <span style="color: #C678DD;">self</span>.idx &lt; <span style="color: #56B6C2;">len</span>(<span style="color: #C678DD;">self</span>):
            <span style="color: #E06C75;">item</span> = <span style="color: #C678DD;">self</span>.primes[<span style="color: #C678DD;">self</span>.idx]
            <span style="color: #C678DD;">self</span>.<span style="color: #E06C75;">idx</span> += 1
            <span style="color: #C678DD;">return</span> item
        <span style="color: #C678DD;">else</span>:
            <span style="color: #C678DD;">raise</span> <span style="color: #E5C07B;">StopIteration</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7dc350" class="outline-4">
<h4 id="orgc7dc350"><span class="section-number-4">3.1.15.</span> <code>__iter__</code> and <code>__next__</code></h4>
<div class="outline-text-4" id="text-3-1-15">
<p>
And now we can iterate over this class
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #E06C75;">prime_numbers</span> = Primes()

<span style="color: #C678DD;">for</span> prime_number <span style="color: #C678DD;">in</span> prime_numbers:
    <span style="color: #56B6C2;">print</span>(prime_number)
</pre>
</div>

<pre class="example">
Results: 
