2022-2023/Programming Level-up/2.object-oriented-programming.tex
# => Vector(2, 5)
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org8ad744a},fragile]{dunder-methods}
 There are many more dunder-methods you should know when creating classes. We shall go through:

\begin{itemize}
\item \texttt{\_\_len\_\_} -- specify how the length of the class should be computed.
\item \texttt{\_\_getitem\_\_} -- how to index over the class
\item \texttt{\_\_call\_\_} -- how to use the class like a function
\item \texttt{\_\_iter\_\_} -- what to do when iteration starts
\item \texttt{\_\_next\_\_} -- what to do at the next step of the iteration
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4717e23},fragile]{\texttt{\_\_len\_\_}}
 The \texttt{\_\_len\_\_} function allows us to specify how the \texttt{len()} function acts on the
class. Take this hypothetical dataset. We create a \texttt{\_\_len\_\_} function that returns the
length of the unique elements in the dataset.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
class Dataset:
    def __init__(self, data):
        self.data = data

    def __len__(self):
        """Return the length of unique elements"""
        return len(set(self.data))

data = Dataset([1, 2, 3, 3, 3, 5, 1])
print(len(data))
\end{minted}

\begin{verbatim}
Results: 
# => 4
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgaaf0fee},fragile]{\texttt{\_\_getitem\_\_}}
 Next \texttt{\_\_getitem\_\_} allows us to index over a class. This new function must include \texttt{self}
and a variable to pass the index. Here I've used \texttt{idx}. In this function I am simply
indexing on the on the classes \texttt{self.data}.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
class Dataset:
    def __init__(self, data):
        self.data = data

    def __getitem__(self, idx):
        return self.data[idx]

data = Dataset([1, 2, 3, 3, 3, 5, 1])
print(data[2])
\end{minted}

\begin{verbatim}
Results: 
# => 3
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org8952eda},fragile]{\texttt{\_\_call\_\_}}
 In a small number of cases, it is nice to use the class just like a function. This is
what \texttt{\_\_call\_\_} allows us to do. In this function we specify what should happen when
class is 'called' like a function. In this simple example, we are creating a function
that prints the type of food being used as a parameter to the function.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
class Jaguar:
    def __call__(self, food):
        print(f"The jaguar eats the {food}.")

food = "apple"
animal = Jaguar()

animal(food)
\end{minted}

\begin{verbatim}
Results: 
# => The jaguar eats the apple.
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgfb0bbd5},fragile]{\texttt{\_\_iter\_\_} and \texttt{\_\_next\_\_}}
 \texttt{\_\_iter\_\_} and \texttt{\_\_next\_\_} allow us to make our class iterable, i.e. we can use it in a
\texttt{for} loop for example.

The \texttt{\_\_iter\_\_} function should define what happens when we start the iteration, and
\texttt{\_\_next\_\_} defines what happens at every step of the iteration.

Let's take a look at an example where we have an iterable set of prime numbers.
\end{frame}

\begin{frame}[label={sec:orgd3229f8},fragile]{\texttt{\_\_iter\_\_} and \texttt{\_\_next\_\_}}
 \begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
class Primes:
    def __init__(self):
        self.primes = [2, 3, 5, 7, 11]

    def __iter__(self):
        self.idx = 0
        return self

    def __len__(self):
        return len(self.primes)

    def __next__(self):
        if self.idx < len(self):
            item = self.primes[self.idx]
            self.idx += 1
            return item
        else:
            raise StopIteration
\end{minted}
\end{frame}

\begin{frame}[label={sec:org027467f},fragile]{\texttt{\_\_iter\_\_} and \texttt{\_\_next\_\_}}
 And now we can iterate over this class

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,bgcolor=LightGray,xleftmargin=5pt,tabsize=2,breaklines=true,numbersep=10pt]{python}
prime_numbers = Primes()

for prime_number in prime_numbers:
    print(prime_number)
\end{minted}

\begin{verbatim}
Results: 
