2022-2023/Programming Level-up/2.object-oriented-programming.html
# =&gt; 2
# =&gt; 3
# =&gt; 5
# =&gt; 7
# =&gt; 11
</pre>
</div>
</div>

<div id="outline-container-orgf8dfad0" class="outline-4">
<h4 id="orgf8dfad0"><span class="section-number-4">3.1.16.</span> Inheritance</h4>
<div class="outline-text-4" id="text-3-1-16">
<p>
One special thing about OOP is that its normally designed to provide inheritance &#x2013;
this is true in Python. Inheritance is where you have a base class, and other classes
inherit from this base class. This means that the class that inherits from the base
class has access to the same methods and class variables. In some cases, it can
override some of these features.
</p>

<p>
Let's take a look an example.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Animal</span>:
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">growl</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #56B6C2;">print</span>(<span style="color: #98C379;">"The animal growls"</span>)

    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">walk</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #C678DD;">raise</span> NotImplementError
</pre>
</div>

<p>
Here we have created a simple class called Animal, that has two functions, one of
which will raise an error if its called.
</p>
</div>
</div>

<div id="outline-container-orgac4984f" class="outline-4">
<h4 id="orgac4984f"><span class="section-number-4">3.1.17.</span> Inheritance</h4>
<div class="outline-text-4" id="text-3-1-17">
<p>
We can inherit from this Animal class by placing our base class in <code>()</code> after the new
class name.
</p>

<p>
Here we are creating two classes, Tiger and Duck. Both of these new classes inherit
from Animal. Also, both of these classes are overriding the walk functions. But they
are not creating a growl method themselves.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Tiger</span>(Animal):
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">walk</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #56B6C2;">print</span>(<span style="color: #98C379;">"The Tiger walks through the jungle"</span>)

<span style="color: #C678DD;">class</span> <span style="color: #E5C07B;">Duck</span>(Animal):
    <span style="color: #C678DD;">def</span> <span style="color: #61AFEF;">walk</span>(<span style="color: #C678DD;">self</span>):
        <span style="color: #56B6C2;">print</span>(<span style="color: #98C379;">"The Duck walks through the jungle"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org87ad9f8" class="outline-4">
<h4 id="org87ad9f8"><span class="section-number-4">3.1.18.</span> Inheritance</h4>
<div class="outline-text-4" id="text-3-1-18">
<p>
Look at what happens when we create instances of these classes, and call the
functions. First we see that the correct method has been called. I.e. for the duck
class, the correct <code>walk</code> method was called.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #E06C75;">first_animal</span> = Tiger()
<span style="color: #E06C75;">second_animal</span> = Duck()

first_animal.walk()
second_animal.walk()
</pre>
</div>

<pre class="example">
Results: 
# =&gt; The Tiger walks through the jungle
# =&gt; The Duck walks through the jungle
</pre>
</div>
</div>

<div id="outline-container-org33ae360" class="outline-4">
<h4 id="org33ae360"><span class="section-number-4">3.1.19.</span> Inheritance</h4>
<div class="outline-text-4" id="text-3-1-19">
<p>
But what happens if we call the <code>.growl()</code> method?
</p>

<div class="org-src-container">
<pre class="src src-python">first_animal.growl()
second_animal.growl()
</pre>
</div>

<pre class="example">
Results: 
# =&gt; The animal growls
# =&gt; The animal growls
</pre>


<p>
We see that it still works. Even though both Duck and Tiger didn't create a <code>.growl()</code>
method, it inherited it from the base class Animal. This works for class methods and
class variables.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbee7ae7" class="outline-2">
<h2 id="orgbee7ae7"><span class="section-number-2">4.</span> Exercise</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org528c13d" class="outline-3">
<h3 id="org528c13d"><span class="section-number-3">4.1.</span> Exercise</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org44070a6" class="outline-4">
<h4 id="org44070a6"><span class="section-number-4">4.1.1.</span> An object based library system</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
We're going to improve on our library system from last lecture. Instead of a
<code>functional</code> style of code, we're going to use a OOP paradigm to create our solution.
</p>

<p>
Like last time, we're going to create our solution one step at a time.
</p>

<p>
First, we need to create our class called <code>Database</code>. This database is going to take an
optional parameter in its init function &#x2013; the data. If the user specifies data
(represented as a list of dictionaries like last time), then the class will populate
a class variable called data, else this class variable will be set to an empty list.
</p>

<p>
Summary:
</p>
<ul class="org-ul">
<li>Create a class called <code>Database</code>.</li>
<li>When creating an instance of <code>Database</code>, the user can optionally specify a list of
dictionaries to initialise the class variable <code>data</code> with. If no data is provided,
this class variable will be initialised to an empty list.</li>
</ul>
</div>
</div>
