2022-2023/Programming Level-up/2.object-oriented-programming.org
*** Adding data

We will want to include a function to add data to our database.

Create a class method called =add=, that takes three arguments (in addition to =self= of
course), the title, the author, and the release date.

This add function adds the new book entry to the end of =data=. Populate this database
with the following information.

#+ATTR_LATEX: :environment tabularx :width \textwidth :align XXX :booktabs t
|---------------------------------+------------------------+--------------|
| Title                           | Author                 | Release Date |
|---------------------------------+------------------------+--------------|
| Moby Dick                       | Herman Melville        |         1851 |
| A Study in Scarlet              | Sir Arthur Conan Doyle |         1887 |
| Frankenstein                    | Mary Shelley           |         1818 |
| Hitchhikers Guide to the Galaxy | Douglas Adams          |         1879 |
|---------------------------------+------------------------+--------------|

*** Locating a book

Create a class method called locate by tile that takes the title of the book to look
up, and returns the dictionary of all books that have this title. Unlike last time,
we don't need to pass the =data= as an argument, as its contained within the class.

*** Updating our database

Create a class method called =update= that takes 4 arguments:, 1) the key of the value
we want to update 2) the value we want to update it to 3) the key we want to check
to find out if we have the correct book and 4) the value of the key to check if we
have the correct book.

#+begin_src python
db.update(key="release year", value=1979, where_key="title",
	  where_value="Hitchhikers Guide to the Galaxy")
#+end_src

Use this to fix the release data of the Hitchhiker's book.

*** Printed representation

Using the =__str__= dunder-method (this is similar to =__repr__= as we saw before),
create a function that prints out a formatted representation of the entire database
as a string. Some of the output should look like:

#+begin_src python
Library System
--------------

Entry 1:
- Name: Moby Dick
- Author: Herman Melville
- Release Date: 1851
...
#+end_src

*** Extending our OOP usage

So far we've used a list of dictionaries. One issue with this is that there is no
constraints on the keys we can use. This will certainly create problems if certain
keys are missing.

Instead of using dictionaries. We can create another class called =Book= that will take
three arguments when it is initialised: =name=, =author=, and =release_date=. The init
function should initialise three class variables to save this information.

Modify the database to, instead of working with a list of dictionaries, work with a
list of Book objects.

*** Printed representation -- challenge.

Improve upon the printed representation of the last exercise but instead of bulleted
lists, use formatted tables using =f-string= formatting
(https://zetcode.com/python/fstring/).

The output should look like this:

#+begin_src python
Library System
--------------

| Name           | Author           | Release Data |
|----------------|------------------|--------------|
| Moby Dick      | Herman Melville  |         1851 |
...
#+end_src

Notice how Release date is right justified, while Name and Author are left justified.

# Local Variables:
# org-latex-minted-options: (("frame" "lines") ("linenos=true") ("firstnumber=last") ("fontsize=\\footnotesize") ("bgcolor=LightGray") ("xleftmargin=5pt") ("tabsize=2") ("breaklines=true") ("numbersep=10pt"))
# End:
