2022-2023/Programming Level-up/2.object-oriented-programming.html

<div id="outline-container-org8d56891" class="outline-4">
<h4 id="org8d56891"><span class="section-number-4">4.1.2.</span> Adding data</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
We will want to include a function to add data to our database.
</p>

<p>
Create a class method called <code>add</code>, that takes three arguments (in addition to <code>self</code> of
course), the title, the author, and the release date.
</p>

<p>
This add function adds the new book entry to the end of <code>data</code>. Populate this database
with the following information.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-right">Release Date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Moby Dick</td>
<td class="org-left">Herman Melville</td>
<td class="org-right">1851</td>
</tr>

<tr>
<td class="org-left">A Study in Scarlet</td>
<td class="org-left">Sir Arthur Conan Doyle</td>
<td class="org-right">1887</td>
</tr>

<tr>
<td class="org-left">Frankenstein</td>
<td class="org-left">Mary Shelley</td>
<td class="org-right">1818</td>
</tr>

<tr>
<td class="org-left">Hitchhikers Guide to the Galaxy</td>
<td class="org-left">Douglas Adams</td>
<td class="org-right">1879</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6d3b05d" class="outline-4">
<h4 id="org6d3b05d"><span class="section-number-4">4.1.3.</span> Locating a book</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Create a class method called locate by tile that takes the title of the book to look
up, and returns the dictionary of all books that have this title. Unlike last time,
we don't need to pass the <code>data</code> as an argument, as its contained within the class.
</p>
</div>
</div>

<div id="outline-container-org6105411" class="outline-4">
<h4 id="org6105411"><span class="section-number-4">4.1.4.</span> Updating our database</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Create a class method called <code>update</code> that takes 4 arguments:, 1) the key of the value
we want to update 2) the value we want to update it to 3) the key we want to check
to find out if we have the correct book and 4) the value of the key to check if we
have the correct book.
</p>

<div class="org-src-container">
<pre class="src src-python">db.update(key=<span style="color: #98C379;">"release year"</span>, value=1979, where_key=<span style="color: #98C379;">"title"</span>,
          where_value=<span style="color: #98C379;">"Hitchhikers Guide to the Galaxy"</span>)
</pre>
</div>

<p>
Use this to fix the release data of the Hitchhiker's book.
</p>
</div>
</div>

<div id="outline-container-org99cba8e" class="outline-4">
<h4 id="org99cba8e"><span class="section-number-4">4.1.5.</span> Printed representation</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
Using the <code>__str__</code> dunder-method (this is similar to <code>__repr__</code> as we saw before),
create a function that prints out a formatted representation of the entire database
as a string. Some of the output should look like:
</p>

<div class="org-src-container">
<pre class="src src-python">Library System
--------------

Entry 1:
- Name: Moby Dick
- Author: Herman Melville
- Release Date: 1851
...
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd219c6a" class="outline-4">
<h4 id="orgd219c6a"><span class="section-number-4">4.1.6.</span> Extending our OOP usage</h4>
<div class="outline-text-4" id="text-4-1-6">
<p>
So far we've used a list of dictionaries. One issue with this is that there is no
constraints on the keys we can use. This will certainly create problems if certain
keys are missing.
</p>

<p>
Instead of using dictionaries. We can create another class called <code>Book</code> that will take
three arguments when it is initialised: <code>name</code>, <code>author</code>, and <code>release_date</code>. The init
function should initialise three class variables to save this information.
</p>

<p>
Modify the database to, instead of working with a list of dictionaries, work with a
list of Book objects.
</p>
</div>
</div>

<div id="outline-container-org3be4fbc" class="outline-4">
<h4 id="org3be4fbc"><span class="section-number-4">4.1.7.</span> Printed representation &#x2013; challenge.</h4>
<div class="outline-text-4" id="text-4-1-7">
<p>
Improve upon the printed representation of the last exercise but instead of bulleted
lists, use formatted tables using <code>f-string</code> formatting
(<a href="https://zetcode.com/python/fstring/">https://zetcode.com/python/fstring/</a>).
</p>

<p>
The output should look like this:
</p>

<div class="org-src-container">
<pre class="src src-python">Library System
--------------

| Name           | Author           | Release Data |
|----------------|------------------|--------------|
| Moby Dick      | Herman Melville  |         1851 |
...
</pre>
</div>

<p>
Notice how Release date is right justified, while Name and Author are left justified.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-10-01</p>
<p class="author">Author: Jay Morgan</p>
<p class="date">Created: 2022-09-11 Sun 08:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
